app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT `doctors`.* FROM `doctors`