app/controllers/hospitals_controller.rb

SELECT `hospitals`.* FROM `hospitals`
---
  def index
    if params[:search].present?
      @hospitals = HospitalSearchQuery.new(params[:search]).call
    else
      @hospitals = Hospital.all

INSERT INTO `hospitals` (`name`, `country`, `city`, `phone_number`, `created_at`, `updated_at`) VALUES ('rjyhtrsgfs', 't,umrynjthbgrv', 'tumryjnthbgrv', '7856534', '2024-03-01 13:41:43.289985', '2024-03-01 13:41:43.289985')
---
  def create
    @hospital = Hospital.new(hospital_params)

    respond_to do |format|
      if @hospital.save

DELETE FROM `hospitals` WHERE `hospitals`.`id` = 1
---
  def destroy
    @hospital.destroy

SELECT `hospitals`.* FROM `hospitals` WHERE `hospitals`.`id` = 1 LIMIT 1
---
    def set_hospital
      @hospital = Hospital.find(params[:id])