app/controllers/medical_records_controller.rb

  def index
    @medical_records = MedicalRecord.all
---
SELECT `medical_records`.* FROM `medical_records`