app/controllers/patients_controller.rb

SELECT `patients`.* FROM `patients`
---
  def index
    @patients = Patient.all

INSERT INTO `patients` (`name`, `gender`, `date_of_birth`, `created_at`, `updated_at`) VALUES ('djosafldk aekf;skdsa', 'm', '2002-10-18', '2024-03-01 13:42:52.613097', '2024-03-01 13:42:52.613097')
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

SELECT `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1
---
  def set_patient
    @patient = Patient.find(params[:id])